app/services/user_likes_music_service/user_likes_music_poster.rb

INSERT INTO `user_likes_musics` (`user_id`, `created_at`, `updated_at`) VALUES (2, '2023-01-02 06:56:24.842260', '2023-01-02 06:56:24.842260')
---
        def call

            user_likes_music = UserLikesMusic.create!(user_id: @current_user.id, music_id: @music_id)