app/services/user_likes_music_service/user_likes_music_canceler.rb

SELECT `user_likes_musics`.* FROM `user_likes_musics` WHERE `user_likes_musics`.`user_id` = 2 AND `user_likes_musics`.`music_id` = 1 LIMIT 1
DELETE FROM `user_likes_musics` WHERE `user_likes_musics`.`id` = 8
---
        def call
            auth_result = AuthService::Authorizer.call(request: @request)
            return auth_result if auth_result.is_a?(Hash)
            @user_id = auth_result


            destroy_music = UserLikesMusic.find_by(user_id: @user_id, music_id: @music_id)

            raise ActiveRecord::RecordNotFound if destroy_music.nil?

            destroy_music.destroy!