app/services/user_likes_music_service/user_likes_musics_getter.rb

SELECT `user_likes_musics`.* FROM `user_likes_musics` WHERE `user_likes_musics`.`user_id` = 1
---
        def call
            auth_result = AuthService::Authorizer.call(request: @request)
            return auth_result if auth_result.is_a?(Hash)
            @user_id = auth_result

            user_liked_list = UserLikesMusic.where(user_id: @user_id)
            user_liked_list.map(&:as_json_of_music)