app/services/user_service/user_groups_getter.rb

        def call
            do_authorization
            user_groups = UserGroup.where(user_id: @user_id)
            user_groups.map(&:as_json_of_group)
---
SELECT `user_groups`.* FROM `user_groups` WHERE `user_groups`.`user_id` = 1
SELECT `user_groups`.* FROM `user_groups` WHERE `user_groups`.`user_id` IS NULL