app/services/user_service/user_playlist_music_destroyer.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1
SELECT 1 AS one FROM `user_playlist_musics` WHERE `user_playlist_musics`.`user_id` = 12 AND `user_playlist_musics`.`music_id` = 1 LIMIT 1
SELECT `user_playlist_musics`.* FROM `user_playlist_musics` WHERE `user_playlist_musics`.`user_id` = 12
SELECT `users`.* FROM `users` WHERE `users`.`user_id` = 12
SELECT `users`.* FROM `users` WHERE `users`.`user_id` = 12 LIMIT 11
DELETE FROM `user_playlist_musics` WHERE `user_playlist_musics`.`id` = 98
SELECT `user_playlist_musics`.* FROM `user_playlist_musics` WHERE `user_playlist_musics`.`user_id` = 12 AND `user_playlist_musics`.`music_id` = 1 ORDER BY `user_playlist_musics`.`created_at` ASC LIMIT 1
---
        def call
            results = []
            @music_ids.each do |music_id|
                result = { destroyed_music_id: music_id }

                user = User.find(@user_id)
                musics = user.user_playlist_musics.where(music_id: music_id).order(created_at: :asc).limit(1)
                if musics.empty?
                    result[:message] = "Not Existing Music So Cannot Destroy"
                    result[:success] = false
                else
                    begin
                        musics.first.destroy