app/services/user_service/user_group_exiter.rb

        def call
            do_authorization

            group_user = UserGroup.find_by(user_id: @user_id, group_id: @group_id)
            if group_user.nil?
                return {success: false, message: "User is not a member of group"}
            else
                group_user.destroy
---
SELECT `user_groups`.* FROM `user_groups` WHERE `user_groups`.`user_id` = 1 AND `user_groups`.`group_id` = 1 LIMIT 1
DELETE FROM `user_groups` WHERE `user_groups`.`id` = 4
DELETE FROM `group_users` WHERE `group_users`.`id` = 3