app/services/user_service/user_signin.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'taeheon.ki@ringleplus.com' LIMIT 1
---
        def call
            user = User.find_by(email: @email)