app/services/user_service/user_group_musics_destroyer.rb

        def call
            do_authorization
            group_exist_validation
            results = []
            @music_ids.each do |music_id|
                result = {destroyed_music_id: music_id}

                group = Group.find(@group_id)
                musics = group.group_musics.where(music_id: music_id).order(created_at: :asc).limit(1)
                if musics.empty?
                    result[:message] = "Not Existing Music So Cannot Destroy"
                    result[:success] = false
                else
                    begin
                        musics.first.destroy
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1
SELECT 1 AS one FROM `group_musics` WHERE `group_musics`.`group_id` = 2 AND `group_musics`.`music_id` = 21 LIMIT 1
DELETE FROM `group_musics` WHERE `group_musics`.`id` = 78
SELECT `group_musics`.* FROM `group_musics` WHERE `group_musics`.`group_id` = 2 AND `group_musics`.`music_id` = 21 ORDER BY `group_musics`.`created_at` ASC LIMIT 1

        def group_exist_validation
            unless UserGroup.exists?(user_id: @user_id, group_id: @group_id)
---
SELECT 1 AS one FROM `user_groups` WHERE `user_groups`.`user_id` = 1 AND `user_groups`.`group_id` = 2 LIMIT 1