app/services/user_service/user_group_playlist_musics_destroyer.rb

        def call
            results = []
            @music_ids.each do |music_id|
                result = {destroyed_music_id: music_id}

                group = Group.find(@group_id)
                musics = group.group_playlist_musics.where(music_id: music_id).order(created_at: :asc).limit(1)
                if musics.empty?
                    result[:message] = "Not Existing Music So Cannot Destroy"
                    result[:success] = false
                else
                    begin
                        musics.first.destroy
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 12 LIMIT 1
SELECT 1 AS one FROM `group_playlist_musics` WHERE `group_playlist_musics`.`group_id` = 2 AND `group_playlist_musics`.`music_id` = 1 LIMIT 1
DELETE FROM `group_playlist_musics` WHERE `group_playlist_musics`.`id` = 34
SELECT `group_playlist_musics`.* FROM `group_playlist_musics` WHERE `group_playlist_musics`.`group_id` = 2 AND `group_playlist_musics`.`music_id` = 1 ORDER BY `group_playlist_musics`.`created_at` ASC LIMIT 1