app/services/user_service/user_musics_destroyer.rb

        def call
            do_authorization
            results = []
            @music_ids.each do |music_id|
                result = { destroyed_music_id: music_id }
                begin
                    user = User.find(@user_id)
                rescue
                    return {success: false, message: "User Not Found"}
                end
                musics = user.user_musics.where(music_id: music_id).order(created_at: :asc).limit(1)
                puts musics.empty?
                if musics.empty?
                    result[:message] = "Not Existing Music So Cannot Destroy"
                    result[:success] = false
                else
                    begin
                        musics.first.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT 1 AS one FROM `user_musics` WHERE `user_musics`.`user_id` = 1 AND `user_musics`.`music_id` = 21 LIMIT 1
SELECT `user_musics`.* FROM `user_musics` WHERE `user_musics`.`user_id` = 12 AND `user_musics`.`music_id` = 2 ORDER BY `user_musics`.`created_at` ASC LIMIT 1
DELETE FROM `user_musics` WHERE `user_musics`.`id` = 118
SELECT `user_musics`.* FROM `user_musics` WHERE `user_musics`.`user_id` = 1 AND `user_musics`.`music_id` = 21 ORDER BY `user_musics`.`created_at` ASC LIMIT 1