app/services/user_service/user_musics_getter.rb

SELECT `user_musics`.* FROM `user_musics` WHERE `user_musics`.`user_id` = 12
SELECT `user_musics`.* FROM `user_musics` WHERE `user_musics`.`user_id` = 1
---
        def call
            auth_result = AuthService::Authorizer.call(request: @request)
            return auth_result if auth_result.is_a?(Hash)
            @user_id = auth_result
            user_liked_list = UserMusic.includes(:music).where(user_id: @user_id)
            user_liked_list.map(&:as_json_of_music)