app/services/user_service/user_playlist_music_adder.rb

        def call
            results = []
            @music_ids.each do |music_id|
                result = { music_id: music_id}
                begin
                    UserPlaylistMusic.create!({user_id: @user_id, music_id: music_id})
                    user = User.find(@user_id)
                    if user.user_playlist_musics.count >= 100
                        destroy_music = user.user_playlist_musics.order(created_at: :asc).first
                        result[:destroyed] = destroy_music.as_music_json
                        user.user_playlist_musics.order(created_at: :asc).first.destroy
---
INSERT INTO `user_playlist_musics` (`user_id`, `music_id`, `created_at`, `updated_at`) VALUES (12, 1, '2022-12-29 08:28:50.562039', '2022-12-29 08:28:50.562039')
SELECT `users`.* FROM `users` WHERE `users`.`user_id` = 12 LIMIT 1
SELECT COUNT(*) FROM `user_playlist_musics` WHERE `user_playlist_musics`.`user_id` = 12
SELECT `user_playlist_musics`.* FROM `user_playlist_musics` WHERE `user_playlist_musics`.`user_id` = 12 ORDER BY `user_playlist_musics`.`created_at` ASC LIMIT 1
DELETE FROM `user_playlist_musics` WHERE `user_playlist_musics`.`id` = 42