app/services/user_service/user_likes_musics_getter.rb

SELECT `user_likes_musics`.* FROM `user_likes_musics` WHERE `user_likes_musics`.`user_id` = 12
---
        def call
            user_liked_list = UserLikesMusic.where(user_id: @user_id)
            user_liked_list.map(&:as_music_json)