app/services/user_service/user_musics_adder.rb

        def call
            do_authorization
            results = []
            @music_ids.each do |music_id|
                result = { music_id_added: music_id}
                begin
                    UserMusic.create!({user_id: @user_id, music_id: music_id})
                    user = User.find(@user_id)
                    user_musics = user.user_musics
                    if user_musics.count >= 100
                        destroy_music = user_musics.order(created_at: :asc).first
                        result[:destroyed] = destroy_music.as_json_of_music
                        destroy_music.destroy
---
INSERT INTO `user_musics` (`user_id`, `music_id`, `created_at`, `updated_at`) VALUES (1, 21, '2022-12-30 08:59:50.126379', '2022-12-30 08:59:50.126379')
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `user_musics` WHERE `user_musics`.`user_id` = 1
SELECT `user_musics`.* FROM `user_musics` WHERE `user_musics`.`user_id` = 1 ORDER BY `user_musics`.`created_at` ASC LIMIT 1
DELETE FROM `user_musics` WHERE `user_musics`.`id` = 1