app/services/user_service/user_getter.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
        def call
            do_authorization
            begin
                user = User.find(@user_id).as_json(only: [:id, :user_name, :email])