app/services/user_service/user_group_exiter.rb

        def call

            group_user = GroupUser.find_by(user_id: @user_id, group_id: @group_id)
---
SELECT `group_users`.* FROM `group_users` WHERE `group_users`.`user_id` = 12 AND `group_users`.`group_id` = 2 LIMIT 1