app/services/user_service/user_signup.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'jiyong.jung@ringleplus.com' LIMIT 1
INSERT INTO `users` (`user_name`, `created_at`, `updated_at`, `email`, `encrypted_password`) VALUES ('jaejun.han', '2022-12-30 08:21:24.817616', '2022-12-30 08:21:24.817616', 'jaejun.han@ringleplus.com', '$2a$12$ppQNU0J2fjuv4sF4LTJjdumgHZMh4eBLT72cVXAGfxrBmrxZBr8IS')
---
        def call
            user = User.find_by(email: @email)
            if user
                return {
                    success: false,
                    message: "User Email Not Usable"
                }
            end

            user = User.create!({
                user_name: @user_name,
                email: @email,
                password: @password
            })