app/services/user_service/user_group_musics_adder.rb

        def call
            do_authorization
            group_exist_validation
            results = []
            @music_ids.each do |music_id|
                result = {music_id: music_id}
                begin
                    GroupMusic.create!({group_id: @group_id, music_id: music_id, user_id: @user_id})

                    group = Group.find(@group_id)
                    group_musics = group.group_musics
                    if group_musics.count >= 100
                        destroy_music = group_musics.order(created_at: :asc).first
                        result[:destroyed] = destroy_music.music.as_json(only: [:title, :artist, :album, :user_likes_musics_count])
                        destroy_music.destroy
---
INSERT INTO `group_musics` (`group_id`, `music_id`, `created_at`, `updated_at`, `user_id`) VALUES (2, 18, '2022-12-30 08:44:19.935358', '2022-12-30 08:44:19.935358', 1)
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1
SELECT `musics`.* FROM `musics` WHERE `musics`.`id` = 21 LIMIT 1
SELECT `group_musics`.* FROM `group_musics` WHERE `group_musics`.`group_id` = 2 ORDER BY `group_musics`.`created_at` ASC LIMIT 1
SELECT COUNT(*) FROM `group_musics` WHERE `group_musics`.`group_id` = 2
DELETE FROM `group_musics` WHERE `group_musics`.`id` = 3

        def group_exist_validation
            unless UserGroup.exists?(user_id: @user_id, group_id: @group_id)
---
SELECT 1 AS one FROM `user_groups` WHERE `user_groups`.`user_id` = 1 AND `user_groups`.`group_id` = 2 LIMIT 1