app/services/user_service/user_likes_music_canceler.rb

        def call
            begin
                destroy_music = UserLikesMusic.find_by(user_id: @user_id, music_id: @music_id)
                if destroy_music.nil?
                    return {success: false, message: "User is not liking this music"}
                end
                destroy_music.destroy
---
SELECT `user_likes_musics`.* FROM `user_likes_musics` WHERE `user_likes_musics`.`user_id` = 1 AND `user_likes_musics`.`music_id` IS NULL LIMIT 1
DELETE FROM `user_likes_musics` WHERE `user_likes_musics`.`id` = 5