app/services/user_service/user_group_musics_getter.rb

        def call
            do_authorization
            group_exist_validation
            unless UserGroup.exists?(user_id: @user_id, group_id: @group_id)
                return {success: false, message: "user is not existing in group. Validation Falied!"}
            end
            user_liked_list = GroupMusic.includes(:music).where(user_id: @user_id)
            user_liked_list.map(&:as_json_of_group_music)
---
SELECT 1 AS one FROM `user_groups` WHERE `user_groups`.`user_id` = 1 AND `user_groups`.`group_id` = 2 LIMIT 1
SELECT `group_musics`.* FROM `group_musics` WHERE `group_musics`.`user_id` = 1
SELECT `musics`.* FROM `musics` WHERE `musics`.`id` IN (22, 21, 18)
SELECT `musics`.* FROM `musics` WHERE `musics`.`id` = 1