app/services/user_service/user_playlist_music_getter.rb

        def call
            user_liked_list = UserPlaylistMusic.includes(:music).where(user_id: @user_id)
            user_liked_list.map(&:as_music_json)
---
SELECT `musics`.* FROM `musics` WHERE `musics`.`id` IN (1, 2)
SELECT `user_playlist_musics`.* FROM `user_playlist_musics` WHERE `user_playlist_musics`.`user_id` = 12