app/services/user_service/user_groups_getter.rb

SELECT `group_users`.* FROM `group_users` WHERE `group_users`.`user_id` = 1
---
        def call
            user_groups = GroupUser.where(user_id: @user_id)