app/services/user_service/user_likes_music_poster.rb

        def call
            begin
                user_likes_music = UserLikesMusic.create!(user_id: @user_id, music_id: @music_id)
---
INSERT INTO `user_likes_musics` (`user_id`, `music_id`, `created_at`, `updated_at`) VALUES (12, 1, '2022-12-30 01:57:16.640368', '2022-12-30 01:57:16.640368')