app/services/user_service/user_group_joiner.rb

INSERT INTO `group_users` (`group_id`, `user_id`, `created_at`, `updated_at`) VALUES (2, 12, '2022-12-30 01:28:03.148007', '2022-12-30 01:28:03.148007')
INSERT INTO `user_groups` (`group_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2022-12-30 05:52:55.701725', '2022-12-30 05:52:55.701725')
---
        def call
            begin
                if !Group.exists?(@group_id)
                    return {success:false, message: "Group not exists"}
                end
                GroupUser.create!({user_id: @user_id, group_id: @group_id})