app/services/user_service/user_likes_music_getter.rb

        def call
            user_liked_list = UserLikesMusic.includes(:music).where(user_id: @user_id)
            user_liked_list.map(&:as_json)
---
SELECT `musics`.* FROM `musics` WHERE `musics`.`id` IN (2, 1)
SELECT `user_likes_musics`.* FROM `user_likes_musics` WHERE `user_likes_musics`.`user_id` = 14