app/services/music_service/music_searcher.rb

        def call

            if @query.present?
                musics = Music.where(
                    "SOUNDEX(title) = SOUNDEX(:query) OR title LIKE :like_query OR
                    SOUNDEX(artist) = SOUNDEX(:query) OR artist LIKE :like_query OR
                    SOUNDEX(album) = SOUNDEX(:query) OR album LIKE :like_query",
                    query: @query, like_query: "%#{@query}%")
            else
                musics = Music.all
---
SELECT `musics`.* FROM `musics`