app/services/user_music_service/user_musics_destroyer.rb

        def call
            auth_result = AuthService::Authorizer.call(request: @request)
            return auth_result if auth_result.is_a?(Hash)
            @user_id = auth_result

            results = []
            user = User.find(@user_id)

            @music_ids.each do |music_id|
                result = { destroyed_music_id: music_id }

                musics = user.user_musics.where(music_id: music_id).order(created_at: :asc).limit(1)

                if musics.empty?
                    result[:message] = "Not Existing Music So Cannot Destroy"
                    result[:success] = false
                else

                    musics.first.destroy!
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT 1 AS one FROM `user_musics` WHERE `user_musics`.`user_id` = 2 AND `user_musics`.`music_id` = 21 LIMIT 1
DELETE FROM `user_musics` WHERE `user_musics`.`id` = 10
SELECT `user_musics`.* FROM `user_musics` WHERE `user_musics`.`user_id` = 2 AND `user_musics`.`music_id` = 1 ORDER BY `user_musics`.`created_at` ASC LIMIT 1