app/services/user_music_service/user_musics_adder.rb

INSERT INTO `user_musics` (`user_id`, `music_id`, `created_at`, `updated_at`) VALUES (2, 1, '2023-01-02 06:38:27.934686', '2023-01-02 06:38:27.934686')
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT COUNT(*) FROM `user_musics` WHERE `user_musics`.`user_id` = 2
---
        def call
            auth_result = AuthService::Authorizer.call(request: @request)
            return auth_result if auth_result.is_a?(Hash)
            @user_id = auth_result
            begin
                UserMusic.insert_all(@music_ids.map {|music_id| {
                    user_id: @user_id, music_id: music_id,
                    created_at: Time.current, updated_at: Time.current}})
            rescue => e
                return {success: false, e_message: e.message ,message: "Insertion Failed! All Insertion Rollbacked"}
            end
            result = {}
            user = User.find(@user_id)
            user_musics_count = user.user_musics.count