app/services/group_music_service/group_musics_adder.rb

        def call
            auth_result = AuthService::Authorizer.call(request: @request)
            return auth_result if auth_result.is_a?(Hash)
            @user_id = auth_result

            unless UserGroup.exists?(user_id: @user_id, group_id: @group_id)
                return {success: false, message: "user is not existing in group"}
            end

            GroupMusic.insert_all!(
                @music_ids.map {|music_id| {
                user_id: @user_id, music_id: music_id, group_id: @group_id}})

            result = {}
            group = Group.find(@group_id)

            group_musics_count = group.group_musics.count
---
SELECT 1 AS one FROM `user_groups` WHERE `user_groups`.`user_id` = 2 AND `user_groups`.`group_id` = 2 LIMIT 1
INSERT INTO `group_musics` (`group_id`, `music_id`, `created_at`, `updated_at`, `user_id`) VALUES (2, 1, '2023-01-02 07:15:57.925577', '2023-01-02 07:15:57.925577', 2)
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1
SELECT COUNT(*) FROM `group_musics` WHERE `group_musics`.`group_id` = 2