app/services/group_music_service/group_musics_destroyer.rb

        def call
            auth_result = AuthService::Authorizer.call(request: @request)
            return auth_result if auth_result.is_a?(Hash)
            @user_id = auth_result

            unless UserGroup.exists?(user_id: @user_id, group_id: @group_id)
                return {success: false, message: "user is not existing in group"}
            end
            results = []
            @music_ids.each do |music_id|
                result = {destroyed_music_id: music_id}

                group = Group.find(@group_id)
                musics = group.group_musics.where(music_id: music_id).order(created_at: :asc).limit(1)
                if musics.empty?
                    result[:message] = "Not Existing Music So Cannot Destroy"
                    result[:success] = false
                else
                    begin
                        musics.first.destroy
---
SELECT 1 AS one FROM `user_groups` WHERE `user_groups`.`user_id` = 2 AND `user_groups`.`group_id` = 2 LIMIT 1
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1
SELECT 1 AS one FROM `group_musics` WHERE `group_musics`.`group_id` = 2 AND `group_musics`.`music_id` = 21 LIMIT 1
DELETE FROM `group_musics` WHERE `group_musics`.`id` = 2
SELECT `group_musics`.* FROM `group_musics` WHERE `group_musics`.`group_id` = 2 AND `group_musics`.`music_id` = 1 ORDER BY `group_musics`.`created_at` ASC LIMIT 1