app/services/group_music_service/group_musics_getter.rb

        def call
            auth_result = AuthService::Authorizer.call(request: @request)
            return auth_result if auth_result.is_a?(Hash)
            @user_id = auth_result

            unless UserGroup.exists?(user_id: @user_id, group_id: @group_id)
                return {success: false, message: "user is not existing in group"}
            end

            user_liked_list = GroupMusic.includes(:music).where(user_id: @user_id)
            user_liked_list.map(&:as_json_of_group_music)
---
SELECT 1 AS one FROM `user_groups` WHERE `user_groups`.`user_id` = 2 AND `user_groups`.`group_id` = 2 LIMIT 1
SELECT `group_musics`.* FROM `group_musics` WHERE `group_musics`.`user_id` = 2
SELECT `musics`.* FROM `musics` WHERE `musics`.`id` = 1