app/services/group_service/group_creater.rb

INSERT INTO `groups` (`group_name`, `created_at`, `updated_at`) VALUES ('jazz', '2022-12-30 07:56:12.563795', '2022-12-30 07:56:12.563795')
---
        def call

            Group.create!(user_id: @current_user.id, group_name: @group_name)