app/services/group_service/groups_getter.rb

SELECT `groups`.* FROM `groups`
---
        def call
            groups = Group.all