app/services/user_group_service/user_groups_getter.rb

SELECT `user_groups`.* FROM `user_groups` WHERE `user_groups`.`user_id` = 2
---
        def call
            auth_result = AuthService::Authorizer.call(request: @request)
            return auth_result if auth_result.is_a?(Hash)
            @user_id = auth_result

            user_groups = UserGroup.where(user_id: @user_id)
            user_groups.map(&:as_json_of_group)