app/services/user_group_service/user_group_joiner.rb

        def call

            raise ActiveRecord::RecordNotFound , "UserGroup Not Exists" unless Group.exists?(@group_id)

            UserGroup.create!({user_id: @current_user.id, group_id: @group_id})
---
INSERT INTO `user_groups` (`group_id`, `user_id`, `created_at`, `updated_at`) VALUES (3, 2, '2023-01-02 07:21:50.301420', '2023-01-02 07:21:50.301420')