app/api/ringle_music/v1/musics.rb

SELECT `musics`.* FROM `musics`
---
                    # Search for musics by title, artist, or album
                    musics = Music.all
                    if params[:q].present?
                        musics = musics.select do |music|