app/api/ringle_music/v1/musics.rb

SELECT `musics`.* FROM `musics`
---
            desc 'Return list of songs'
            get do
              # Return all musics if no parameters are specified
              musics = Music.all

SELECT `musics`.* FROM `musics`
SELECT `musics`.* FROM `musics` WHERE (title LIKE '%rock%' OR artist LIKE '%rock%' OR album LIKE '%rock%')
---
            end
            get :search do
              # Search for musics by title, artist, or album
              musics = Music.all
              musics = musics.where("title LIKE ? OR artist LIKE ? OR album LIKE ?", "%#{params[:q]}%", "%#{params[:q]}%", "%#{params[:q]}%") if params[:q].present?