app/api/ringle_music/v1/music_api.rb

INSERT INTO `user_playlist_musics` (`user_id`, `music_id`, `created_at`, `updated_at`) VALUES (12, 1, '2022-12-29 01:35:12.327818', '2022-12-29 01:35:12.327818')
---
                        }
                    end

                    UserPlaylistMusic.create!({user_id: result[:user_id], music_id: params[:music_id]})