app/models/group_playlist_music.rb

SELECT COUNT(*) FROM `group_playlist_musics` WHERE `group_playlist_musics`.`group_id` = 1
---
  def check_playlist_size
    if group.group_playlist_musics.count >= 100