app/models/group_user.rb

SELECT 1 AS one FROM `group_users` WHERE `group_users`.`group_id` IS NULL AND `group_users`.`user_id` = 7 LIMIT 1
---
  def unique_membership
    if GroupUser.where(group: group, user: user).exists?