app/models/user_group.rb

SELECT 1 AS one FROM `user_groups` WHERE `user_groups`.`group_id` = 1 AND `user_groups`.`user_id` = 1 LIMIT 1
---
  def unique_membership
    if UserGroup.where(group: group, user: user).exists?