app/models/user_playlist_music.rb

SELECT `user_playlist_musics`.* FROM `user_playlist_musics` WHERE `user_playlist_musics`.`user_id` = 12 ORDER BY `user_playlist_musics`.`created_at` ASC LIMIT 1
SELECT COUNT(*) FROM `user_playlist_musics` WHERE `user_playlist_musics`.`user_id` = 12
DELETE FROM `user_playlist_musics` WHERE `user_playlist_musics`.`id` = 13
---
  def check_playlist_size
    if user.user_playlist_musics.count >= 100
      user.user_playlist_musics.order(created_at: :asc).first.destroy