app/models/user_likes_music.rb

  def unique_membership
    if UserLikesMusic.where(user_id: user.id, music_id: music.id).exists?
---
SELECT 1 AS one FROM `user_likes_musics` WHERE `user_likes_musics`.`user_id` IS NULL AND `user_likes_musics`.`music_id` = 16 LIMIT 1
SELECT `musics`.* FROM `musics` WHERE `musics`.`id` = 16 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 12 LIMIT 1